In [4]:
import pandas as pd
df = pd.read_csv('amazon_data.csv')

In [6]:
df

,product_author,product_img_link,product_name,product_price,product_ratings,product_stars
0,"Barack Obama,\n\n\n\nHolly Whitaker\n\n\n,\n\n...",https://m.media-amazon.com/images/I/81NI6sqvvk...,"\n\n\n\n,\n\n\n\n\n,\n\n\n\n,\n\n\n\n\n,\n\n\n...","0,.,00,12,.,66,18,.,57,20,.,49,20,.,99,17,.,39...","65,101,1,514,37,12,641,116,295,16,1,128,1,150,...","4.9 out of 5 stars,4.4 out of 5 stars,4.9 out ..."
1,product_author,product_img_link,product_name,product_price,product_ratings,product_stars
2,"Barack Obama,\n\n\n\nHolly Whitaker\n\n\n,\n\n...",https://m.media-amazon.com/images/I/81NI6sqvvk...,"\n\n\n\n,\n\n\n\n\n,\n\n\n\n,\n\n\n\n\n,\n\n\n...","0,.,00,12,.,66,18,.,57,20,.,49,20,.,99,17,.,39...","65,101,1,514,37,12,641,116,295,16,1,128,1,150,...","4.9 out of 5 stars,4.4 out of 5 stars,4.9 out ..."